'number' + 3 + 3 // відповідь "number33" — тому що 'number'+3="number3" (конкатенація), і далі "number3"+3="number33"

null + 3 // відповідь 3 — тому що null буде конвертуватися в 0, і далі 0+3=3

5 && "qwerty" // відповідь "qwerty" — тому що після перевірки 5 повернуло truthy, іде далі праворуч і повертає останнє qwerty

+'40' + +'2' + "hillel" // відповідь "42hillel" — тому що +'40'=40, +'2'=2, 40+2=42, далі конкатенація 42+"hillel"="42hillel"

'10' - 5 === 6 // відповідь false — тому що спочатку рядок '10' конвертується в число, '10'-5=5, далі іде порівняння відповідей 5===6, що не дорівнює, тому false

true + false // відповіль 1 — тому що true=1, false=0, і 1+0=1

'4px' - 3 // відповідь NaN — тому що '4px' не конвертується в число через рх,тому результат NaN. Далі NaN-3=NaN

'4' - 3 // відповідь 1 — тому що '4' конвертується в 4, 4-3=1

'6' + 3 ** 0 // відповідь "61" — тому що спочатку рахується степінь **, бо має найвищий пріорітет, 3**0=1 ,далі '6'+1 = конкатенація "61"

12 / '6' // відповідь 2 — тому що '6' конвертується в 6, 12/6=2

'10' + (5 === 6) // відповідь "10false" — тому що 5===6 буде false, і далі '10'+false = конкатенація "10false"

null == '' // відповідь false — тому що null рівний тільки null або undefined при нестрогому порівнянні. А тут порівняння з порожнім рядком

3 ** (9 / 3) // відповідь 27 — тому що спочатку виконуються дужки 9/3=3, а потім степінь 3**3=27

!!'false' == !!'true' // відповідь true — тому що спочатку перевертаємо непорожній truthy рядок !!'false'=true, потім теж саме з другим рядком !!'true'=true, і порявнюємо true==true

0 || '0' && 1 // відповідь 1 — тому що спочатку рахується && вищий пріорітет '0'&&1=1 ('0' не порожній рядок), а потім порівняння зліва направо 0||1=1

(+null == false) < 1 // відповідь false — тому що +null=0, 0==false нестроге порівняння, тому повертає true, далі true конвертується в 1. І 1<1=false

false && true || true // відповідь true — тому що споатку false&&true=false, а потім false||true=true

false && (false || true) // відповідь false — тому що споатку дужки (false||true)=true, а потім false&&true=false. Далі false && не рахує.

(+null == false) < 1 ** 5 // відповідь false — тому що спочатку степінь 1**5=1, далі рахуємо +null=0, далі 0==false неспроге порівняння, тому true, далі підставляємо отриманні значення в дужки і виходить true<1. Рахуємо і true конвертується в число 1. Далі 1<1=false