// ============================================================
// Завдання 5
// ============================================================
/**
 Напиши функцію, яка отримує масив чисел і повертає об'єкт із такими властивостями:
   - min  — мінімальне число
   - max  — максимальне число
   - sum  — сума всіх чисел
   - avg  — середнє значення (округлити до 2 знаків після коми)

 Очікуваний результат:
 getStats([3, 7, 1, 9, 4]) => { min: 1, max: 9, sum: 24, avg: 4.80 }
 */

function getStats(arr) {
    // Ваш код тут:
let sum = 0;
    let min = arr[0];
    let max = arr[0];
    for (let i = 0; i < arr.length; i++) 
        {
        sum += arr[i];
        if (arr[i] < min) min = arr[i];
        if (arr[i] > max) max = arr[i];
    }
    return {
        min: min,
        max: max,
        sum: sum,
        avg: Math.round(sum / arr.length * 100) / 100
    };
}
console.log(getStats([3, 7, 1, 9, 4]));