// ============================================================
// Завдання 3
// ============================================================
/**
 Є масив чисел. Поверни новий масив, де кожне число замінено на його квадрат.
 Числа, які менше нуля, виключи з результату.

 Очікуваний результат:
 squarePositive([1, -2, 3, -4, 5]) => [1, 9, 25]
 */

function squarePositive(arr) {
    // Ваш код тут:
    let result = [];
    for (let i = 0; i < arr.length; i++) 
        {
        if (arr[i] >= 0) 
            {
            result.push(arr[i] * arr[i]);
        }
    }
    return result;
}

console.log(squarePositive([1, -2, 3, -4, 5]));