// ============================================================
// Завдання 2
// ============================================================
/**
 Є масив рядків із іменами студентів.
 Відфільтруй тільки ті імена, які починаються на літеру "А" (або "а").
 Поверни новий масив.

 Очікуваний результат:
 filterByLetter(["Андрій", "Богдан", "Аліна", "Олег", "Антон"]) => ["Андрій", "Аліна", "Антон"]
 */

function filterByLetter(names) {
    // Ваш код тут:
    return names.filter(name => name[0] === "А");
}

console.log(filterByLetter(["Андрій", "Богдан", "Аліна", "Олег", "Антон"]));