// ============================================================
// Завдання 1
// ============================================================
/**
 Є масив чисел. Знайди суму всіх елементів масиву.

 Очікуваний результат:
 sumNumbers([1, 2, 3, 4, 5]) => 15
 sumNumbers([10, 20, -5]) => 25
 */

function sumNumbers(arr) {
    // Ваш код тут:
    let sum = 0;
    for (let i = 0; i < arr.length; i++) {
        sum += arr[i];
    }
    return sum;
}

console.log(sumNumbers([1, 2, 3, 4, 5]));
console.log(sumNumbers([10, 20, -5]));