// ============================================================
// Завдання 4
// ============================================================
/**
 Поясни у вигляді коментаря — в якому порядку виведуться рядки і чому.
 Потім запусти і перевір.

 Порядок: 1 -> 4 -> 3 -> 2
 */

/* console.log("1");
setTimeout(function() { console.log("2"); }, 0);
Promise.resolve().then(function() { console.log("3"); });
console.log("4"); */

/* Ваш коментар (порядок та причина):
Рядок 1: виконується, тому що це звичайний синхроний код, виконається одразу і першим
Рядок 2: не виконається одразу, пропускається через setTimeout, функція іде в Callback Queue
Рядок 3: не виконається одразу, пропускається через Promise, функція іде в Microtask Queue, має вищий пріорітет, тому виконається перед Callback Queue
Рядок 4: виконується, тому що це звичайний синхроний код, виконається одразу, наступним після рядка 1
*/
// Підказка: окрім Callback Queue є ще Microtask Queue (для Promise),
// яка має вищий пріоритет!